assume cs:code

code segment
    ; 程序功能：
    ;     读取 0 面 0 道 1 扇区的内容到 0:200
    ; 入口参数：
    ;     (ah)=13h 的功能号（2 表示读扇区）
    ;     (al)=读取的扇区数
    ;     (ch)=磁道号
    ;     (cl)=扇区号
    ;     (dh)=磁头号（对于软盘即面号，因为一个面用一个磁头来读写）
    ;     (dl)=驱动器号（软驱从 0 开始：0 代表软驱A，1 代表软驱B；硬盘从 80h 开始，80h 代表硬盘C，81h 代表硬盘D）
    ;     es:bx 指向接收从扇区读入数据的内存区
    ; 返回参数：
    ;     操作成功：(ah)=0，(al)=读入的扇区数
    ;     操作失败：(ah)=出错代码
    start:
        mov ax, 0
        mov es, ax
        mov bx, 200h        ; es:bx 指向接收从扇区读入数据的内存区

        mov ah, 2           ; int 13h 的功能号（2 号子程序表示读扇区）
        mov al, 1           ; 读取的扇区数
        mov ch, 0           ; 磁道号
        mov cl, 10           ; 扇区号
        mov dh, 0           ; 磁头号（对于软盘即面号，因为一个面用一个磁头来读写）
        mov dl, 80h         ; 驱动器号（软驱从 0 开始：0 代表软驱A，1 代表软驱B；硬盘从 80h 开始，80h 代表硬盘C，81h 代表硬盘D）
        int 13h

        mov ax, 4c00h
        int 21h
code ends

end start